app/controllers/requests_controller.rb

SELECT * FROM "requests" WHERE ("requests".user_id = 2)
---
  def index
  if current_user.admin == true
  @requests = Request.all

SELECT * FROM "requests" WHERE ("requests"."id" = 0)
---
  def show
    @request = Request.find(params[:id])

INSERT INTO "requests" ("authorised", "created_at", "updated_at", "total", "user_id", "leavedate", "returndate") VALUES(NULL, '2012-01-27 12:17:16', '2012-01-27 12:17:16', 3, NULL, '2012-01-27', '2012-01-30')
---
  def create
    @request = Request.new(params[:request])
    @request.user_id = current_user.id
    if @request.save

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
---
  def edit
    @request = Request.find(params[:id])

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
UPDATE "requests" SET "total" = 3, "updated_at" = '2012-01-25 12:43:19', "returndate" = '2012-01-28' WHERE "id" = 1
---
  def update
    @request = Request.find(params[:id])
    if @request.update_attributes(params[:request])

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
DELETE FROM "requests" WHERE "id" = 1
---
  def destroy
    @request = Request.find(params[:id])
    @request.destroy